Revit 2024 API
ApplicationMacroOptions Enumeration
 The application macro options.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum ApplicationMacroOptions
Visual Basic
Public Enumeration ApplicationMacroOptions
Visual C++
public enum class ApplicationMacroOptions
Members
Member name | Description
EnableMacros |  The option to enable macros for the application.
DisableMacros |  The option to disable macros for the application.
See Also
Autodesk.Revit.DB.Macros Namespace